-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 10.0.231.119
-- Время создания: Апр 10 2026 г., 14:26
-- Версия сервера: 8.0.37-29
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `a1186497_test`
--

-- --------------------------------------------------------

--
-- Структура таблицы `sys_address_localities`
--

CREATE TABLE `sys_address_localities` (
  `id` bigint UNSIGNED NOT NULL,
  `source` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'osm',
  `source_key` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `normalized_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `center_lat` decimal(10,7) NOT NULL,
  `center_lng` decimal(10,7) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `sys_address_localities`
--

INSERT INTO `sys_address_localities` (`id`, `source`, `source_key`, `name`, `normalized_name`, `center_lat`, `center_lng`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'osm', 'node:281428908', 'Новоалтайск', 'новоалтайск', 53.4121560, 83.9320738, 1, '2026-03-11 13:54:19', '2026-03-11 13:54:19'),
(2, 'osm', 'node:1251375063', 'Бажево', 'бажево', 53.4164760, 83.9958345, 1, '2026-03-11 13:54:27', '2026-03-11 13:54:27'),
(5, 'osm', 'node:1251375070', 'Берёзовка', 'березовка', 53.4062920, 83.9996640, 1, '2026-03-11 13:57:51', '2026-03-11 13:57:51'),
(9, 'osm', 'node:1251375028', 'Солнечное', 'солнечное', 53.3932180, 83.9953458, 1, '2026-03-11 14:05:17', '2026-03-11 14:05:17'),
(10, 'osm', 'node:1409402869', 'Новый', 'новый', 53.3848473, 83.9989541, 1, '2026-03-11 14:05:25', '2026-03-11 14:05:25'),
(11, 'osm', 'node:1911751294', 'Санниково', 'санниково', 53.3543430, 83.9727170, 1, '2026-03-11 14:07:16', '2026-03-11 14:07:16'),
(12, 'osm', 'node:281429402', 'Зудилово', 'зудилово', 53.4766200, 83.8826680, 1, '2026-03-11 14:07:27', '2026-03-11 14:07:27'),
(13, 'osm', 'node:413405150', 'Фирсово', 'фирсово', 53.3172450, 83.9551770, 1, '2026-03-11 14:08:21', '2026-03-11 14:08:21'),
(14, 'osm', 'node:569357795', 'Боровиха', 'боровиха', 53.5064010, 83.8425140, 1, '2026-03-11 14:08:35', '2026-03-11 14:08:35'),
(15, 'osm', 'node:27505285', 'Барнаул', 'барнаул', 53.3475493, 83.7788448, 1, '2026-03-11 14:09:52', '2026-03-11 14:09:52'),
(16, 'osm', 'node:1251375084', 'Правда', 'правда', 53.4355952, 84.1289538, 1, '2026-03-11 14:10:19', '2026-03-11 14:10:19'),
(17, 'osm', 'node:413405177', 'Казачий', 'казачий', 53.5316437, 83.8405080, 1, '2026-03-11 14:10:26', '2026-03-11 14:10:26'),
(18, 'osm', 'node:413405156', 'Повалиха', 'повалиха', 53.5121161, 83.7683023, 1, '2026-03-11 14:11:47', '2026-03-11 14:11:47'),
(19, 'osm', 'node:1251375095', 'Покровка', 'покровка', 53.3374406, 84.1353615, 1, '2026-03-11 14:11:54', '2026-03-11 14:11:54'),
(20, 'osm', 'node:413405154', 'Лосиха', 'лосиха', 53.3253400, 84.1288150, 1, '2026-03-11 14:12:08', '2026-03-11 14:12:08'),
(21, 'osm', 'node:1985598796', 'Ильича', 'ильича', 53.5522281, 84.0155663, 1, '2026-03-11 14:13:16', '2026-03-11 14:13:16'),
(22, 'osm', 'node:413405155', 'Кислуха', 'кислуха', 53.4986000, 83.7108000, 1, '2026-03-11 14:13:25', '2026-03-11 14:13:25'),
(23, 'osm', 'node:1251375052', '193 км', '193 км', 53.5490340, 83.7979890, 1, '2026-03-11 14:13:32', '2026-03-11 14:13:32'),
(24, 'osm', 'node:1251375035', 'Новый Мир', 'новый мир', 53.4768074, 84.1821372, 1, '2026-03-11 14:15:18', '2026-03-11 14:15:18'),
(25, 'osm', 'node:4457151053', 'Октябрьское', 'октябрьское', 53.5699706, 83.8449403, 1, '2026-03-11 14:15:24', '2026-03-11 14:15:24'),
(26, 'osm', 'node:413405151', 'Лесной', 'лесной', 53.2437117, 83.9737015, 1, '2026-03-11 14:15:30', '2026-03-11 14:15:30'),
(27, 'osm', 'node:1251375068', 'Баюновские Ключи', 'баюновские ключи', 53.3327432, 84.1908246, 1, '2026-03-11 14:17:21', '2026-03-11 14:17:21'),
(28, 'osm', 'node:1251375090', 'Логовское', 'логовское', 53.4985370, 84.1980171, 1, '2026-03-11 14:17:37', '2026-03-11 14:17:37'),
(29, 'osm', 'node:1251375048', 'Бешенцево', 'бешенцево', 53.5192929, 84.1802004, 1, '2026-03-11 14:17:51', '2026-03-11 14:17:51'),
(30, 'osm', 'node:413405157', 'Костяки', 'костяки', 53.5551517, 83.7409314, 1, '2026-03-11 14:18:50', '2026-03-11 14:18:50'),
(31, 'osm', 'node:1256345158', 'Ползуново', 'ползуново', 53.2984507, 83.6909529, 1, '2026-03-11 14:18:58', '2026-03-11 14:18:58'),
(32, 'osm', 'node:1251375087', 'Сибирский', 'сибирский', 53.5782146, 83.7666847, 1, '2026-03-11 14:19:10', '2026-03-11 14:19:10'),
(33, 'osm', 'node:1409408389', 'Плодопитомник', 'плодопитомник', 53.2591324, 83.7341544, 1, '2026-03-11 14:20:48', '2026-03-11 14:20:48'),
(34, 'osm', 'node:1256345147', 'Казённая Заимка', 'казенная заимка', 53.4031410, 83.6069870, 1, '2026-03-11 14:20:55', '2026-03-11 14:20:55'),
(35, 'osm', 'node:1256345149', 'Борзовая Заимка', 'борзовая заимка', 53.2903060, 83.6564560, 1, '2026-03-11 14:21:08', '2026-03-11 14:21:08'),
(36, 'osm', 'node:1251375029', 'Лесная Поляна', 'лесная поляна', 53.5727164, 83.7175657, 1, '2026-03-11 14:22:48', '2026-03-11 14:22:48'),
(68, 'osm', 'node:413405175', 'Сорочий Лог', 'сорочий лог', 53.5747164, 84.1450397, 1, '2026-03-12 05:46:09', '2026-03-12 05:46:09'),
(69, 'osm', 'node:1409408388', 'Землянуха', 'землянуха', 53.4038599, 83.5837753, 1, '2026-03-12 05:46:10', '2026-03-12 05:46:10'),
(70, 'osm', 'node:1256345118', 'Гоньба', 'гоньба', 53.4157030, 83.5777130, 1, '2026-03-12 05:46:10', '2026-03-12 05:46:10'),
(71, 'osm', 'node:281428696', 'Южный', 'южный', 53.2547490, 83.6938860, 1, '2026-03-12 05:46:11', '2026-03-12 05:46:11'),
(72, 'osm', 'node:1409408390', 'Садоводов', 'садоводов', 53.2432055, 83.7060846, 1, '2026-03-12 05:46:11', '2026-03-12 05:46:11'),
(73, 'osm', 'node:1251375097', 'Волга', 'волга', 53.6301473, 83.9880918, 1, '2026-03-12 05:46:11', '2026-03-12 05:46:11'),
(74, 'osm', 'node:1256345162', 'Власиха', 'власиха', 53.2906000, 83.6223000, 1, '2026-03-12 05:46:12', '2026-03-12 05:46:12'),
(75, 'osm', 'way:93846074', 'Пригородный', 'пригородный', 53.3052223, 83.6064137, 1, '2026-03-12 05:46:12', '2026-03-12 05:46:12'),
(76, 'osm', 'node:413405173', 'Жилино', 'жилино', 53.4059930, 84.3065176, 1, '2026-03-12 05:46:12', '2026-03-12 05:46:12');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `sys_address_localities`
--
ALTER TABLE `sys_address_localities`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_sys_address_localities_source_key` (`source`,`source_key`),
  ADD KEY `idx_sys_address_localities_name` (`normalized_name`),
  ADD KEY `idx_sys_address_localities_active_name` (`is_active`,`name`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `sys_address_localities`
--
ALTER TABLE `sys_address_localities`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=157;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
